## PostgreSQL Summary Stats and Window Functions

Creating queries for analytics and data engineering with window functions.

Kaggle dataset of summer olympics:

- https://www.kaggle.com/the-guardian/olympic-games

In [1]:
%load_ext sql

Connect to the empty database made with pgadmin

In [2]:
%sql postgresql://postgres:eric@localhost:5432/postgres

'Connected: postgres@postgres'

### 1 Window Functions

ORDER BY and PARTION BY

Create table and import the data

In [3]:
%%sql
CREATE TABLE  Summer_Medals(
    year integer,
    city varchar,
    sport varchar,
    discipline varchar,
    athlete varchar,
    country varchar,
    gender varchar,
    event varchar,
    medal varchar
);

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.ProgrammingError) relation "summer_medals" already exists
 [SQL: 'CREATE TABLE  Summer_Medals(\n    year integer,\n    city varchar,\n    sport varchar,\n    discipline varchar,\n    athlete varchar,\n    country varchar,\n    gender varchar,\n    event varchar,\n    medal varchar\n);'] (Background on this error at: http://sqlalche.me/e/f405)

In [4]:
%%sql
copy Summer_Medals
from 'D:\\ml_code\\data_science\\sql\\data\\summer.csv'
WITH (FORMAT CSV, HEADER);

 * postgresql://postgres:***@localhost:5432/postgres
31165 rows affected.

[]

In [5]:
%sql select * from Summer_Medals limit 1;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(1896, 'Athens', 'Aquatics', 'Swimming', 'HAJOS Alfred', 'HUN', 'Men', '100M Freestyle', 'Gold')]

### Numbering rows

Try numbering each row in dataset

In [6]:
%%sql
SELECT *,
ROW_NUMBER() OVER() AS Row_N
FROM Summer_Medals
ORDER BY Row_N ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1896, 'Athens', 'Aquatics', 'Swimming', 'HAJOS Alfred', 'HUN', 'Men', '100M Freestyle', 'Gold', 1),
 (1896, 'Athens', 'Aquatics', 'Swimming', 'HERSCHMANN Otto', 'AUT', 'Men', '100M Freestyle', 'Silver', 2),
 (1896, 'Athens', 'Aquatics', 'Swimming', 'DRIVAS Dimitrios', 'GRE', 'Men', '100M Freestyle For Sailors', 'Bronze', 3),
 (1896, 'Athens', 'Aquatics', 'Swimming', 'MALOKINIS Ioannis', 'GRE', 'Men', '100M Freestyle For Sailors', 'Gold', 4),
 (1896, 'Athens', 'Aquatics', 'Swimming', 'CHASAPIS Spiridon', 'GRE', 'Men', '100M Freestyle For Sailors', 'Silver', 5)]

### Numbering Olympic games in ascending order

Where was the 13th olympics held?

In [7]:
%%sql
SELECT
  Year,
  ROW_NUMBER() OVER() AS Row_N
FROM (
  SELECT Distinct Year
  FROM Summer_Medals
  ORDER BY Year ASC
) AS Years
ORDER BY Year ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1896, 1), (1900, 2), (1904, 3), (1908, 4), (1912, 5)]

### Numbering Olympic games in descending order
Reverse the row numbers so that the most recent Olympic games' rows have a lower number.  First use subquery to return distinct years, assign row numbers by years desc and then return result by year default asc

In [8]:
%%sql
SELECT
  Year,
  /*here Assign the lowest numbers to the most recent years*/
  ROW_NUMBER() OVER(ORDER BY Years DESC) AS Row_N
FROM (
  SELECT DISTINCT Year
  FROM Summer_Medals
) AS Years
ORDER BY Year
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1896, 27), (1900, 26), (1904, 25), (1908, 24), (1912, 23)]

### Numbering Olympic athletes by medals earned
Use Row numbering for ranking

Numbering rows and ordering by the count of medals each athlete earned in the OVER clause will assign 1 to the highest-earning medalist, 2 to the second highest-earning medalist, and so on.

Count the number of medals each athlete has earned - select athlete column and count the no of rows each athlete appears in

In [9]:
%%sql
SELECT
Athlete,
COUNT(*) AS Medals
FROM Summer_Medals
GROUP BY Athlete
ORDER BY Medals DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('PHELPS Michael', 44),
 ('LATYNINA Larisa', 36),
 ('ANDRIANOV Nikolay', 30),
 ('MANGIAROTTI Edoardo', 26),
 ('SHAKHLIN Boris', 26)]

wrap the prev query - rank each athlete by number of medals earned.  Insert row number into result of prev query

In [10]:
%%sql
WITH Athlete_Medals AS (
    SELECT
    athlete,
    COUNT(*) AS Medals
    FROM Summer_Medals
    GROUP BY athlete)

SELECT
athlete,
ROW_NUMBER() OVER (ORDER BY medals DESC) AS Row_N
FROM Athlete_Medals
ORDER BY Medals DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('PHELPS Michael', 1),
 ('LATYNINA Larisa', 2),
 ('ANDRIANOV Nikolay', 3),
 ('SHAKHLIN Boris', 4),
 ('ONO Takashi', 5)]

### Reigning weightlifting champions
A reigning champion is a champion who's won both the previous and current years' competitions. To determine if a champion is reigning, the previous and current years' results need to be in the same row, in two different columns.

Get each year's gold medalists in the Men's 69KG weightlifting competition

In [11]:
%%sql
SELECT
  year,
  country AS champion
FROM Summer_Medals
WHERE
  Discipline = 'Weightlifting' AND
  Event = '69KG' AND
  Gender = 'Men' AND
  Medal = 'Gold';

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[(2000, 'BUL'),
 (2004, 'CHN'),
 (2008, 'CHN'),
 (2012, 'CHN'),
 (2000, 'BUL'),
 (2004, 'CHN'),
 (2008, 'CHN'),
 (2012, 'CHN')]

get prev year champion for each year - compare two champion columns to see if champ is reiging

In [12]:
%%sql
WITH Weightlifting_Gold AS (
  SELECT
    /*each year's champions' countries*/
    Year,
    Country AS champion
  FROM Summer_Medals
  WHERE
    Discipline = 'Weightlifting' AND
    Event = '69KG' AND
    Gender = 'Men' AND
    Medal = 'Gold')

SELECT
  Year, Champion,
  /*use lag and one prev to make new column*/
  LAG(Champion,1) OVER
    (ORDER BY year ASC) AS Last_Champion
FROM Weightlifting_Gold
ORDER BY Year ASC;

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[(2000, 'BUL', None),
 (2000, 'BUL', 'BUL'),
 (2004, 'CHN', 'BUL'),
 (2004, 'CHN', 'CHN'),
 (2008, 'CHN', 'CHN'),
 (2008, 'CHN', 'CHN'),
 (2012, 'CHN', 'CHN'),
 (2012, 'CHN', 'CHN')]

### Reigning champions by gender
For multiple events, genders, or other metrics as columns, need to split your table into partitions to avoid having a champion from one event or gender appear as the previous champion of another event or gender.

Use PARTITION BY - allows partitoning of gender so last champion is none when prev partition was male

In [13]:
%%sql
WITH Javelin_Gold AS (
  SELECT DISTINCT
    Gender, Year, Country
  FROM Summer_Medals
  WHERE
    Year >= 2000 AND
    Event = 'Javelin Throw' AND
    Medal = 'Gold')

SELECT
  Gender, Year,
  Country AS Champion,
  /*Fetch the previous year's champion by gender*/
  LAG(Country) OVER (PARTITION BY Gender
                         ORDER BY Year ASC) AS Last_Champion
FROM Javelin_Gold
ORDER BY Gender ASC, Year ASC;

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Men', 2000, 'CZE', None),
 ('Men', 2004, 'NOR', 'CZE'),
 ('Men', 2008, 'NOR', 'NOR'),
 ('Men', 2012, 'TTO', 'NOR'),
 ('Women', 2000, 'NOR', None),
 ('Women', 2004, 'CUB', 'NOR'),
 ('Women', 2008, 'CZE', 'CUB'),
 ('Women', 2012, 'CZE', 'CZE')]

### 2 Fetching, ranking and paging

- fetching values from diff parts of table
- ranking rows according to their values
- binning rows in different tables

### Using LEAD

For each year, fetch the current gold medalist and the gold medalist 3 competitions ahead of the current row.

In [14]:
%%sql
WITH Discus_Medalists AS (
  SELECT DISTINCT
    Year,
    Athlete
  FROM Summer_Medals
  WHERE Medal = 'Gold'
    AND Event = 'Discus Throw'
    AND Gender = 'Women'
    AND Year >= 2000)

SELECT
  /*For each year, fetch the current and future medalists*/
  year,
  athlete,
  LEAD (athlete,3) OVER (ORDER BY year ASC) AS Future_Champion
FROM Discus_Medalists
ORDER BY Year ASC;

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[(2000, 'ZVEREVA Ellina', 'PERKOVIC Sandra'),
 (2004, 'SADOVA Natalya', None),
 (2008, 'BROWN TRAFTON Stephanie', None),
 (2012, 'PERKOVIC Sandra', None)]

### Using FIRST_VALUE

Return all athletes and the first athlete ordered by alphabetical order

In [16]:
%%sql
WITH All_Male_Medalists AS (
  SELECT DISTINCT
    Athlete
  FROM Summer_Medals
  WHERE Medal = 'Gold'
    AND Gender = 'Men')

SELECT
  /*Fetch all athletes and the first althete alphabetically*/
  athlete,
  FIRST_VALUE(athlete) OVER (
    ORDER BY athlete ASC
  ) AS First_Athlete
FROM All_Male_Medalists
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('AABYE Edgar', 'AABYE Edgar'),
 ('AALTONEN Paavo Johannes', 'AABYE Edgar'),
 ('AAS Thomas Valentin', 'AABYE Edgar'),
 ('ABALMASAU Aliaksei', 'AABYE Edgar'),
 ('ABALO Luc', 'AABYE Edgar')]

- Return the year and the city in which each Olympic games were held.
- Fetch the last city in which the Olympic games were held.

In [18]:
%%sql
WITH Hosts AS (
  SELECT DISTINCT Year, City
    FROM Summer_Medals)

SELECT
  Year,
  City,
  /*Get the last city in which the Olympic games were held*/
  LAST_VALUE(city) OVER (
   ORDER BY year ASC
   RANGE BETWEEN
     UNBOUNDED PRECEDING AND
     UNBOUNDED FOLLOWING
  ) AS Last_City
FROM Hosts
ORDER BY Year ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1896, 'Athens', 'London'),
 (1900, 'Paris', 'London'),
 (1904, 'St Louis', 'London'),
 (1908, 'London', 'London'),
 (1912, 'Stockholm', 'London')]

### Using RANK

Rank each athlete by the number of medals they've earned -- the higher the count, the higher the rank -- with identical numbers in case of identical values.

In [20]:
%%sql
WITH Athlete_Medals AS (
  SELECT
    Athlete,
    COUNT(*) AS Medals
  FROM Summer_Medals
  GROUP BY Athlete)

SELECT
  Athlete,
  Medals,
  /*Rank athletes by the medals they've won*/
  RANK() OVER (ORDER BY Medals DESC) AS Row_N
FROM Athlete_Medals
ORDER BY Medals DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('PHELPS Michael', 44, 1),
 ('LATYNINA Larisa', 36, 2),
 ('ANDRIANOV Nikolay', 30, 3),
 ('MANGIAROTTI Edoardo', 26, 4),
 ('ONO Takashi', 26, 4)]

### Ranking athletes from multiple countries using PARTITION

In [21]:
%%sql
WITH Athlete_Medals AS (
  SELECT
    Country, Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country IN ('JPN', 'KOR')
    AND Year >= 2000
  GROUP BY Country, Athlete
  HAVING COUNT(*) > 1)

SELECT
  Country,
  /*Rank athletes in each country by the medals they've won*/
  athlete,
  DENSE_RANK() OVER (PARTITION BY Country
                ORDER BY Medals DESC) AS Rank_N
FROM Athlete_Medals
ORDER BY Country ASC, RANK_N ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('JPN', 'KITAJIMA Kosuke', 1),
 ('JPN', 'UCHIMURA Kohei', 2),
 ('JPN', 'TACHIBANA Miya', 3),
 ('JPN', 'TAKEDA Miho', 3),
 ('JPN', 'SUZUKI Satomi', 4)]

### Using Paging

split using NTILE - useful for buckets

In [26]:
%%sql
WITH Events AS (
  SELECT DISTINCT Event
  FROM Summer_Medals)
  
SELECT
  event,
  NTILE(111) OVER (ORDER BY event ASC) AS Page
FROM Events
ORDER BY Event ASC
LIMIT 7;

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[('- 47.63KG (Flyweight)', 1),
 ('- 47.6KG (Light-Flyweight)', 1),
 ('- 48 KG', 1),
 ('- 48KG', 1),
 ('- 48KG (Extra-Lightweight)', 1),
 ('- 48KG (Light-Flyweight)', 1),
 ('- 49 KG', 2)]

Split the athletes into top, middle, and bottom thirds based on their count of medals.

In [28]:
%%sql
WITH Athlete_Medals AS (
  SELECT Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  GROUP BY Athlete
  HAVING COUNT(*) > 1)
  
SELECT
  Athlete,
  Medals,
  -- Split athletes into thirds by their earned medals
  NTILE(3) OVER (ORDER BY medals DESC) AS Third
FROM Athlete_Medals
ORDER BY Medals DESC, Athlete ASC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('PHELPS Michael', 44, 1),
 ('LATYNINA Larisa', 36, 1),
 ('ANDRIANOV Nikolay', 30, 1),
 ('MANGIAROTTI Edoardo', 26, 1),
 ('ONO Takashi', 26, 1)]

return avg of each third

In [32]:
%%sql
WITH Athlete_Medals AS (
  SELECT Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  GROUP BY Athlete
  HAVING COUNT(*) > 1),
Thirds AS (
  SELECT
    Athlete,
    Medals,
    NTILE(3) OVER (ORDER BY Medals DESC) AS Third
  FROM Athlete_Medals)
  
SELECT
  -- Get the average medals earned in each third
  Third,
  AVG(Medals) AS Avg_Medals
FROM Thirds
GROUP BY Third
ORDER BY Third ASC;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, Decimal('4.2148128624143384')),
 (2, Decimal('2.0000000000000000')),
 (3, Decimal('2.0000000000000000'))]